IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCTAX.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LS-MONTANT        PIC 9(7)V99.
       PROCEDURE DIVISION USING LS-MONTANT.
       CALCUL-TAXE.
           COMPUTE LS-MONTANT = LS-MONTANT * 1.20
           GOBACK.